{
  "intro1": [
    ["", "", "You make your way into a fancy looking office. The room is well furnished and in the back of the room stands a big metal gate. In the room you see a man looking over some documents. "],
    ["data/sprites/host_face.png", "???", "Oh? Can I help you?"],
    ["", "", "The man gets up to greet you."],
    ["", "", "You exchange pleasantries and state your reason for coming here."],
    ["data/sprites/host_face.png", "???", "Ah, I see. So you want to challenge the Arena?"],
    ["data/sprites/host_face.png", "???", "You seem quite young. Have you any experience in combat?"],
    ["data/sprites/host_face.png", "???", "That reminds me. I still haven't introduced myself have I?"],
    ["data/sprites/host_face.png", "Chance", "I am the one they call the director of the Arena. But you can call me Chance."],
    ["data/sprites/host_face.png", "Chance", "Well if you want to register I'm not going to stop you."],
    ["data/sprites/host_face.png", "Chance", "But a fair warning, the Arena is extremely dangerous.\nMany Adventurers, some more experienced than you have lost their lives here."],
    ["data/sprites/host_face.png", "Chance", "Once you join, you are contractually obligated to participate in the fights. You will be rewarded for each fight you win of course, but once you're in a battle there's no turning back."],
    ["data/sprites/host_face.png", "Chance", "While many have challenged the Arena and lived, only one warrior has managed to get to the final floor and emerge victorious. That was 2 years ago."],
    ["data/sprites/host_face.png", "Chance", "I will not think less of you if you decide to turn back this instant and go back to where you came from."],
    ["data/sprites/host_face.png", "Chance", "So decide. Will you really fight in the arena?"],
    ["", "", "Chance holds out a paper and hands you a quill and some ink."],
    ["", "", "You sign the contract with no hesitation."],
    ["data/sprites/host_face.png", "Chance", "..."],
    ["data/sprites/host_face.png", "Chance", "You are truly an interesting person."],
    ["data/sprites/host_face.png", "Chance", "Very well, You may step forward..."],
    ["data/sprites/host_face.png", "Chance", "...And enter the Arena!"]
  ],
  "intro2": [
    ["data/sprites/host_face.png", "Chance", "Welcome to the Arena!"],
    ["data/sprites/host_face.png", "Chance", "Before you get started, you need to know a few things."],
    ["data/sprites/host_face.png", "Chance", "The Arena has 5 floors, In each floor you fight monsters and after you've defeated 5 monsters you can challenge the floor boss."],
    ["data/sprites/host_face.png", "Chance", "After you've defeated the floor boss, you can progress onto the next floor. If you think you're not ready to face the floor boss yet, you can continue fighting the monsters on the floor that you're on until you're strong enough."],
    ["data/sprites/host_face.png", "Chance", "As you progress through the floors, the monsters get stronger and stronger. In order to keep up, you will have to buy new equipment through the Arena shop."],
    ["data/sprites/host_face.png", "Chance", "You can buy the equipment using the gold rewards obtained after beating a monster."],
    ["data/sprites/host_face.png", "Chance", "If you get hurt after a battle, you can sleep at the Inn for a small fee or you can buy healing items from the shop."],
    ["data/sprites/host_face.png", "Chance", "Also, you can find some interesting people around the Arena, so make sure to talk to them. They may have some useful info for you!"],
    ["data/sprites/host_face.png", "Chance", "Well that's about it.. I have high hopes for you."],
    ["data/sprites/host_face.png", "Chance", "Good luck friend... Lord knows you need it!"]
  ],
  "first_floor_victory1": [
    ["data/sprites/host_face.png", "Chance", "Ladies and gentlemen... He's done it!"],
    ["data/sprites/host_face.png", "Chance", "What a thrilling match! Against all odds, he has emerged victorious!"],
    ["data/sprites/host_face.png", "Chance", "Could we finally have a new Champion after 2 years?"],
    ["data/sprites/host_face.png", "Chance", "Only time will tell."],
    ["data/sprites/host_face.png", "Chance", "For now let us cheer once again for this wonderful display of skill by the challenger!"]

  ],
  "first_floor_victory2": [
    ["data/sprites/host_face.png", "Chance", "Hey, let me congratulate you personally. To be honest, while I saw potential in you I didn't think you would beat Tho'k that easily!"],
    ["data/sprites/host_face.png", "Chance", "What I said about him being \"The Gatekeeper\" wasn't an exaggeration. Most challengers don't get past this point."],
    ["data/sprites/host_face.png", "Chance", "But that means from this point onwards it's going to get much harder. The next floor boss isn't one to take lightly."],
    ["data/sprites/host_face.png", "Chance", "Let me make a suggestion. Make your way to the town. You'll find some useful info there as well as some equipment that you may not find in the Arena. It doesn't hurt to be prepared."],
    ["data/sprites/host_face.png", "Chance", "With this victory, you have successfully advanced to the next floor. Take the rest of the day off, we need some time to prepare things on our side. Besides, taking breaks is part of the job!"],
    ["data/sprites/host_face.png", "Chance", "Remember, when you wake up, try visiting the town. You might find something or rather someone interesting there."],
    ["data/sprites/host_face.png", "Chance", "Good luck friend! I'm rooting for you!"]
  ],
  "first_floor_victory3": [
    ["data/sprites/rogue.png", "???", "So.. what did you think of the challengers this time around?"],
    ["data/sprites/rogue.png", "???", "Personally, I've been extremely disappointed so far."],
    ["data/sprites/mysteryman.png", "Stranger", "Hmm.. there was one person in particular that piqued my interest.. The one that defeated the Gatekeeper."],
    ["data/sprites/rogue.png", "???", "What? Why him? Sure, he might be better than most of the weaklings that come through this place but I didn't think he was that strong."],
    ["data/sprites/rogue.png", "???", "He seemed like an amateur to me at first. I admit he was stronger than what I initially thought of him, he did manage to beat that weakling Tho'k after all."],
    ["data/sprites/rogue.png", "???", "But nowhere during his fight did he strike me as someone with potential."],
    ["data/sprites/mysteryman.png", "Stranger", "Heh.. You might be right.. But call it.. my intuition."],
    ["data/sprites/rogue.png", "???", "Intuition? Ha! I think my battle experience is a bit more reliable than your \"Intuition\"!"],
    ["data/sprites/mysteryman.png", "Stranger", "You may be surprised. Who knows.. I suggest you keep an eye on him. He may be just what we need."],
    ["data/sprites/rogue.png", "???", "Hmph, if you say so. Either way, we don't have much time left."],
    ["data/sprites/rogue.png", "???", "Anyways, I would stay here and chat but I've got my own matters to attend to."],
    ["data/sprites/mysteryman.png", "Stranger", "Oh? Could it be.. you've found a lead on.."],
    ["data/sprites/rogue.png", "???", "We're not sure yet. But the intel this time is solid. If we can get our hands on him we can speed this process up by a lot. Still, what kind of a person is he to be able to stay hidden for so long?"],
    ["data/sprites/mysteryman.png", "Stranger", "To put it plain and simple.. He was a monster. If it wasn't for him we would have been ready 2 years ago."],
    ["data/sprites/mysteryman.png", "Stranger", "While he foiled our plans, he took a mortal wound himself. We were sure he was dead. Until people started talking about him again.."],
    ["data/sprites/rogue.png", "???", "The \"Champion of the Arena\", huh? I wonder If I could get a fight with him?"],
    ["data/sprites/mysteryman.png", "Stranger", "Don't be stupid. If you see him, capture him and bring him here. He should be nowhere as strong as he once was. There is also a chance that this could be an impostor.."],
    ["data/sprites/mysteryman.png", "Stranger", "Now go.. Preparations have to be made soon."],
    ["data/sprites/rogue.png", "???", "Heh. I'm looking forward to it."]
  ],
  "floor2_oldman" : [
    ["data/sprites/oldman.png", "Old Man", "Oho! So you've beat the first floor! Now the real challenge begins!"],
    ["data/sprites/oldman.png", "Old Man", "Monsters have different elements that they are weak to. Exploit those weaknesses to come out on top!"]
  ],
  "floor2_boy" : [
    ["data/sprites/boy.png", "Boy", "Mister, I saw you fight! It was sooooo COOL!"],
    ["data/sprites/boy.png", "Boy", "I'm gonna be watching all your fights from now. I'm your biggest fan!"]
  ],
  "floor2_youngman_m" : [
    ["data/sprites/youngman.png", "Young Man", "You remind me of him, you know."],
    ["data/sprites/youngman.png", "Young Man", "The legendary hero. I was there when he won the final challenge. Something about the way you move resembles him."],
    ["data/sprites/youngman.png", "Young Man", "Are you perhaps, his student? No- never mind. He was too young to have a student and besides, he was a warrior, not a mage."]
  ],
  "floor2_youngman_w" : [
    ["data/sprites/youngman.png", "Young Man", "You remind me of him, you know."],
    ["data/sprites/youngman.png", "Young Man", "The legendary hero. I was there when he won the final challenge. Something about the way you move resembles him."],
    ["data/sprites/youngman.png", "Young Man", "Are you perhaps, his student? No- never mind. He was too young to have a student and besides, he was a mage, not a warrior."]
  ],
  "floor2_noble" : [
    ["", "", "Hmph! I lost a lot of money there thanks to you!"],
    ["", "", "I was sure that Tho'k would claim another victim! No matter, I have more opportunities to make money by betting against you."]
    ]
}